app/views/course_modules/index.html.haml

SELECT  "lecturers"."name" FROM "lecturers" WHERE (id = 1) ORDER BY "lecturers"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
        %td= cm.code
        %td= Lecturer.where(:id => cm.lecturer_id).pluck(:name).first