app/controllers/course_modules_controller.rb

SELECT "course_modules".* FROM "course_modules"
SELECT "lecturers".* FROM "lecturers"
---
  def index
    @course_modules = CourseModule.all
    @lecturers = Lecturer.all