app/views/users/registrations/new.html.haml

    %br/
    = f.select :course_id_id, Course.pluck(:name)
  .field
---
SELECT "courses"."name" FROM "courses"